# pandas

- powerful tool for data analysis and manipulation 
- built on top of numpy (makes it very fast and efficient)
- have 2 main data structures : pandas series and pandas dataframe

# pandas series

## creating pandas series 
- using pd.Series(data, indicies)
- it's a 1D array-like object that can hold many data types
 - this is different than a numpy array that could hold only 1 Datatype 
 - another difference is that we can assign index label to each element in the pandas series (we have labels as indices in here)

In [1]:
import pandas as pd

In [2]:
groceries = pd.Series(data=[30,6,"yes","no"], index = ["eggs","apples","milk","bread"])
groceries

eggs       30
apples      6
milk      yes
bread      no
dtype: object

the series is displayed with the indicies (that we assigned) and the values (of different types)

## attributes of information in the data series

In [3]:
groceries.shape # Gives us the sizes of each dimension of the data (here we have 1D with 4 elements)

(4,)

In [5]:
groceries.ndim # Gives us the number of dimensions in the data, it is 1D

1

In [6]:
groceries.size #Gives us the total number of values in the data series

4

### print the index label separately

In [7]:
groceries.index # If we recieved a new data in this structure and we don't know what the labels are b

Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

### print the values separately

In [8]:
groceries.values

array([30, 6, 'yes', 'no'], dtype=object)

## dataseries supports in operator for the labels

In [9]:
# To check wither a certain index is among the indicies for a large data series 
"bananas" in groceries

False

In [10]:
"eggs" in groceries

True

## access the elements of a data series 
1. accessing elements using index labels
2. using numeric indicies (similar to accessing elements in numpy arrays)

1. accessing elements using index labels

In [11]:
groceries["eggs"]

30

provide a list of index labels to get multiple elements

In [12]:
groceries[["eggs","milk"]]

eggs     30
milk    yes
dtype: object

2. using numeric indicies

In [13]:
groceries[0]

30

In [14]:
groceries[-1]

'no'

use a list of numerical indicies to get multiple elements

In [15]:
groceries[[0,2]]

eggs     30
milk    yes
dtype: object

## important!
- what if our named labels were also integers?
- to remove any ambiguity from rather we refer to index label or numerical index, we use loc[ ] and iloc[ ]
- loc[ ] -for location- we use it to explicitly state that we want a labelled index
- iloc[ ] -for integer location- we use it to explicity state that we are using numerical index

In [16]:
groceries.loc[["eggs","milk"]]

eggs     30
milk    yes
dtype: object

In [17]:
groceries.iloc[[0,2]]

eggs     30
milk    yes
dtype: object

## change values of a data series 
- pandas data series are mutable -just like numpy arrays- so we can change the elements of a series after it has been created

In [18]:
groceries

eggs       30
apples      6
milk      yes
bread      no
dtype: object

In [19]:
groceries["eggs"] = 2
groceries

eggs        2
apples      6
milk      yes
bread      no
dtype: object

## delete items in a data series
- using `.drop(given label or index)` method
- but drops it out of place (gives us a copy with the item deleted)
    - to drop it in place, either assign it back to the variable or set the `inplace` argument to `true` (was not there in numpy)

In [20]:
groceries.drop("apples")

eggs       2
milk     yes
bread     no
dtype: object

In [21]:
groceries

eggs        2
apples      6
milk      yes
bread      no
dtype: object

In [22]:
groceries = groceries.drop("apples")
groceries

eggs       2
milk     yes
bread     no
dtype: object

In [23]:
# or instead you can use this 
groceries.drop("bread", inplace=True)
groceries

eggs      2
milk    yes
dtype: object

## Additional Reading - Pandas Series Documentation

Refer to the list of available functions in the following two sections:

- Reindexing / selection / label manipulation
https://pandas.pydata.org/pandas-docs/stable/reference/series.html#reindexing-selection-label-manipulation
- Indexing and iteration
https://pandas.pydata.org/pandas-docs/stable/reference/series.html#indexing-iteration

## arithmetic operations on pandas series
- perform element wise arithmetic operations (like numpy arrays)

## arithmetic operations between pandas series and single numbers

In [24]:
fruits = pd.Series(data=[10,6,3], index=["apples","oranges","bananas"] )
fruits

apples     10
oranges     6
bananas     3
dtype: int64

### element wise operations

In [25]:
fruits + 2

apples     12
oranges     8
bananas     5
dtype: int64

In [26]:
fruits - 2

apples     8
oranges    4
bananas    1
dtype: int64

In [27]:
fruits * 2

apples     20
oranges    12
bananas     6
dtype: int64

In [28]:
fruits/2

apples     5.0
oranges    3.0
bananas    1.5
dtype: float64

## apply mathematical functions from numpy on the dataSeries

In [35]:
fruits = pd.Series(data=[10,6,3], index=["apples","oranges","bananas"] )
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [38]:
import numpy as np

In [39]:
np.sqrt(fruits)

apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

In [40]:
np.exp(fruits)

apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

In [41]:
np.power(fruits,2)

apples     100
oranges     36
bananas      9
dtype: int64

## apply arithmetic operations on selected items

In [42]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [43]:
fruits["bananas"] + 2

5

In [44]:
fruits["bananas"] += 2

In [45]:
fruits

apples     10
oranges     6
bananas     5
dtype: int64

In [46]:
fruits.iloc[0] - 2

8

In [47]:
fruits.loc[["apples","oranges"]] * 2

apples     20
oranges    12
dtype: int64

## apply arithmetic operations on mixed data types
- but the operations must be supported for all of them

In [48]:
groceries = pd.Series(data=[30,6,"yes","no"], index = ["eggs","apples","milk","bread"])
groceries

eggs       30
apples      6
milk      yes
bread      no
dtype: object

In [49]:
groceries * 2

eggs          60
apples        12
milk      yesyes
bread       nono
dtype: object

In [51]:
groceries + 2

TypeError: can only concatenate str (not "int") to str

In [50]:
groceries/2

TypeError: unsupported operand type(s) for /: 'str' and 'int'

## Additional Reading - Pandas Series Documentation

Refer to the Series documentation to have a quick glance at the different attributes of Series, and the optional arguments of the constructor.
https://pandas.pydata.org/pandas-docs/stable/reference/series.html

Example

In [53]:
import pandas as pd

# DO NOT CHANGE THE VARIABLE NAMES

# Given a list representing a few planets
planets = ['Earth', 'Saturn', 'Venus', 'Mars', 'Jupiter']

# Given another list representing the distance of each of these planets from the Sun
# The distance from the Sun is in units of 10^6 km
distance_from_sun = [149.6, 1433.5, 108.2, 227.9, 778.6]


# TO DO: Create a Pandas Series "dist_planets" using the lists above, representing the distance of the planet from the Sun.
# Use the `distance_from_sun` as your data, and `planets` as your index.
dist_planets = pd.Series(data=distance_from_sun,index=planets)


# TO DO: Calculate the time (minutes) it takes light from the Sun to reach each planet. 
# You can do this by dividing each planet's distance from the Sun by the speed of light.
# Use the speed of light, c = 18, since light travels 18 x 10^6 km/minute.

# method 1 time_light = [dist_planets[planet]/18 for planet in planets]
# method 2 time_light = dist_planets.loc[planets] / 18
time_light = dist_planets / 18
print(time_light)
# TO DO: Use Boolean indexing to select only those planets for which sunlight takes less
# than 40 minutes to reach them.
# We'll check your work by printing out these close planets.
close_planets = time_light[time_light < 40]
print(close_planets)
close_planets.index

Earth       8.311111
Saturn     79.638889
Venus       6.011111
Mars       12.661111
Jupiter    43.255556
dtype: float64
Earth     8.311111
Venus     6.011111
Mars     12.661111
dtype: float64

Index(['Earth', 'Venus', 'Mars'], dtype='object')

##### notice that we could use boolean indexing with pandas data series as we did with  numpy!!!!

# pandas Data frame
- the second main data structure in pandas
- it is a 2D object with labelled rows and columns 
- can also hold multiple data types
- it is like a really powerful excil spreadsheet
- mine: it is like the 2D of the data series

## create pandas data frame 
- manually 
- by loading data from a file

### creating dataframes manually

- from a dictionary containing several pandas series 
     - using pd.DataFrame(dictionary)
     - the keys will be the columns and the dataSeries labels will be the rows
         - it will apply union and use Nans for the labels that are missing from any series of them
- from a dictionary containing lists or arrays
- from a list of dictionaries

### 1. dictionary of dataSeries

In [54]:
# a dictionary containing shopping carts of 2 people
# the key is the person's name and the value is a pandas series
# the series labels are the product names and the values are the price of each product
items = {"Bob":pd.Series(data = [245,25,55],index = ["bike",'pants','watch']),
         'Alice':pd.Series(data=[40,110,500,45],index=['book','glasses',"bike",'pants'])}
items

{'Bob': bike     245
 pants     25
 watch     55
 dtype: int64,
 'Alice': book        40
 glasses    110
 bike       500
 pants       45
 dtype: int64}

In [55]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

### Notes
- dataframes are displayed in tabular form with the labels of the rows and columns in Bold
- the row labels are built from the union of the index labels of all the series 
- the column labels are built from the keys of the dictionary 
- the NAN values that appeared (stands for not a number)
 - for example Alice doesn't have a value for the index "watch"
- we have to remove these Nan values before feeding the data into a machine learning algorithm

- if we didn't define indicies for the pandas series, pandas will use numerical row indicies
    - and in union they will be alligned in order

In [56]:
items = {"Bob":pd.Series(data = [245,25,55]),
         'Alice':pd.Series(data=[40,110,500,45])}
items

{'Bob': 0    245
 1     25
 2     55
 dtype: int64,
 'Alice': 0     40
 1    110
 2    500
 3     45
 dtype: int64}

In [57]:
shopping_carts = pd.DataFrame(items)
shopping_carts

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

#### creating a data frame with a subset of the dictionary
- if we don't want all the dictionary's dataSeries and we want only subset of them 
    - we pass the keys of these desired dataseries to the parameter `columns`
    - we pass the desired labels to the parameter `index` if we want the dataSeries but don't want the whole labels inside it 
- using DataFrame() attributes column and index

In [60]:
# a dictionary containing shopping carts of 2 people
# the key is the person's name and the value is a pandas series
# the series labels are the product names and the values are the price of each product
items = {"Bob":pd.Series(data = [245,25,55],index = ["bike",'pants','watch']),
         'Alice':pd.Series(data=[40,110,500,45],index=['book','glasses',"bike",'pants'])}
items

{'Bob': bike     245
 pants     25
 watch     55
 dtype: int64,
 'Alice': book        40
 glasses    110
 bike       500
 pants       45
 dtype: int64}

In [61]:
bob_shopping_cart = pd.DataFrame(items, columns = ["Bob"] )
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [62]:
sel_shopping_cart = pd.DataFrame(items, index=["bike",'pants'])
sel_shopping_cart

       Bob  Alice
bike   245    500
pants   25     45

In [63]:
sel_shopping_cart_alice = pd.DataFrame(items, columns=["Alice"], index=['bike','pants'])
sel_shopping_cart_alice

       Alice
bike     500
pants     45

## 2. create dataframes from dictionary of lists or arrays
- we can also create data frames from a dictionary of lists or arrays 
- but the lists and arrays must have the same length

In [64]:
numbers = {'integers':[1,2,3],
          'floats':[1.5,2.5,3.5]}
numbers_dataframe = pd.DataFrame(numbers)
numbers_dataframe

   integers  floats
0         1     1.5
1         2     2.5
2         3     3.5

- since the lists doesn't have labelled indicies, the data framed index column is created numerically 
- but we can still insert them as well using the `index` attribute

In [65]:
numbers_dataframe = pd.DataFrame(numbers, index=["label1","label2","label3"])
numbers_dataframe

        integers  floats
label1         1     1.5
label2         2     2.5
label3         3     3.5

## create a dataframe from a list of dictionaries

In [66]:
items = [{"bikes":10,"watches":50,"pants":30},
         {"watches":60,"glasses":10,"bikes":15,"pants":7}]
items_dataframe = pd.DataFrame(items,index=["store 1","store 2"])
items_dataframe

         bikes  watches  pants  glasses
store 1     10       50     30      NaN
store 2     15       60      7     10.0

## attributes of information in the data frame

In [67]:
items = {"Bob":pd.Series(data = [245,25,55],index = ["bike",'pants','watch']),
         'Alice':pd.Series(data=[40,110,500,45],index=['book','glasses',"bike",'pants'])}
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

### get index labels (row labels)

In [68]:
shopping_carts.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

### get column labels

In [69]:
shopping_carts.columns

Index(['Bob', 'Alice'], dtype='object')

### get the data

In [70]:
shopping_carts.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

### information about the shape

In [71]:
shopping_carts.shape #5 rows and 2 columns

(5, 2)

In [72]:
shopping_carts.ndim # The data is 2D

2

In [73]:
shopping_carts.size # The total elements in the data

10

### Additional Reading - Pandas Documentation
- Check out the Intro to data structures documentation for an overview of both of the key pandas data structures - Series and DataFrames.
https://pandas.pydata.org/pandas-docs/stable/user_guide/dsintro.html#intro-to-data-structures

- Check out the Attributes and underlying data section in the DataFrame documentation.
https://pandas.pydata.org/pandas-docs/stable/reference/frame.html#dataframe

## accessing elements in pandas data frames
- using row and column labels we can access
 - rows
 - columns 
 - individual elements

In [74]:
items = [{"bikes":10,"watches":50,"pants":30},
         {"watches":60,"glasses":10,"bikes":15,"pants":7}]
store_items = pd.DataFrame(items,index=["store 1","store 2"])
store_items

         bikes  watches  pants  glasses
store 1     10       50     30      NaN
store 2     15       60      7     10.0

access columns

In [75]:
store_items[["bikes"]]

         bikes
store 1     10
store 2     15

In [76]:
store_items[["bikes","pants"]]

         bikes  pants
store 1     10     30
store 2     15      7

access rows

In [77]:
store_items.loc[["store 1"]]

         bikes  watches  pants  glasses
store 1     10       50     30      NaN

access individual element
- the column label always comes first then the row label

In [78]:
store_items['bikes']['store 1']

10

In [83]:
store_items['store 1']["bikes"]

KeyError: 'store 1'

that is because the `[ ]` is for the columns

In [82]:
store_items.loc['store 1']["bikes"]

10.0

## modify data frames (adding rows or columns)

##### add a column

In [84]:
store_items['shirts'] = [22,22]
store_items

         bikes  watches  pants  glasses  shirts
store 1     10       50     30      NaN      22
store 2     15       60      7     10.0      22

##### add a column using arithmetic operations on another columns

In [85]:
store_items['suits'] = store_items['shirts'] + store_items['pants']
store_items

         bikes  watches  pants  glasses  shirts  suits
store 1     10       50     30      NaN      22     52
store 2     15       60      7     10.0      22     29

## add a new column in a certain place
- using `.insert(location, column label, data)`

In [86]:
store_items

         bikes  watches  pants  glasses  shirts  suits
store 1     10       50     30      NaN      22     52
store 2     15       60      7     10.0      22     29

In [87]:
store_items.insert(3, 'shoes',[13,22])
store_items

         bikes  watches  pants  shoes  glasses  shirts  suits
store 1     10       50     30     13      NaN      22     52
store 2     15       60      7     22     10.0      22     29

### add a new row 
- first create a new data frame with the new rows then append it

In [88]:
new_items = [{"bikes":11,"watches":11,'pants':11,'glasses':11,'shirts':11,'suits':11}]
new_store = pd.DataFrame(new_items,index=["store 3"])
new_store

         bikes  watches  pants  glasses  shirts  suits
store 3     11       11     11       11      11     11

In [89]:
store_items.append(new_store)

C:\Users\youse\AppData\Local\Temp\ipykernel_12480\1068459240.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  store_items.append(new_store)

         bikes  watches  pants  shoes  glasses  shirts  suits
store 1     10       50     30   13.0      NaN      22     52
store 2     15       60      7   22.0     10.0      22     29
store 3     11       11     11    NaN     11.0      11     11

In [94]:
store_items

         bikes  watches  pants  shoes  glasses  shirts  suits
store 1     10       50     30     13      NaN      22     52
store 2     15       60      7     22     10.0      22     29

In [95]:
store_items = store_items.append(new_store)
store_items

C:\Users\youse\AppData\Local\Temp\ipykernel_12480\2720228100.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  store_items = store_items.append(new_store)

         bikes  watches  pants  shoes  glasses  shirts  suits
store 1     10       50     30   13.0      NaN      22     52
store 2     15       60      7   22.0     10.0      22     29
store 3     11       11     11    NaN     11.0      11     11

### snippets

In [96]:
store_items["new watches"] = store_items["watches"][1:] + 10
store_items

         bikes  watches  pants  shoes  glasses  shirts  suits  new watches
store 1     10       50     30   13.0      NaN      22     52          NaN
store 2     15       60      7   22.0     10.0      22     29         70.0
store 3     11       11     11    NaN     11.0      11     11         21.0

## delete from the data frame 
- using .pop() method to delete columns , call it pop a column!
    - and it works in place
- or using .drop() method to delete both rows and columns using axis
    - also works in place

In [97]:
store_items

         bikes  watches  pants  shoes  glasses  shirts  suits  new watches
store 1     10       50     30   13.0      NaN      22     52          NaN
store 2     15       60      7   22.0     10.0      22     29         70.0
store 3     11       11     11    NaN     11.0      11     11         21.0

In [98]:
store_items.pop('new watches')

store 1     NaN
store 2    70.0
store 3    21.0
Name: new watches, dtype: float64

In [99]:
store_items

         bikes  watches  pants  shoes  glasses  shirts  suits
store 1     10       50     30   13.0      NaN      22     52
store 2     15       60      7   22.0     10.0      22     29
store 3     11       11     11    NaN     11.0      11     11

In [100]:
store_items = store_items.drop(["pants","shoes"], axis = 1)
store_items

         bikes  watches  glasses  shirts  suits
store 1     10       50      NaN      22     52
store 2     15       60     10.0      22     29
store 3     11       11     11.0      11     11

In [101]:
store_items = store_items.drop(["store 1"], axis = 0)
store_items

         bikes  watches  glasses  shirts  suits
store 2     15       60     10.0      22     29
store 3     11       11     11.0      11     11

In [102]:
store_items

         bikes  watches  glasses  shirts  suits
store 2     15       60     10.0      22     29
store 3     11       11     11.0      11     11

## renaming the labels 
- using the `.rename(columns or index= {old label as key: new label as value})`
    - columns if we will rename a column label
    - index if we will rename a row label
- we can use columns attribute for column label change or index attribute for row label change

In [103]:
store_items

         bikes  watches  glasses  shirts  suits
store 2     15       60     10.0      22     29
store 3     11       11     11.0      11     11

In [104]:
store_items = store_items.rename(columns={'suits':'outfits'})
store_items

         bikes  watches  glasses  shirts  outfits
store 2     15       60     10.0      22       29
store 3     11       11     11.0      11       11

In [105]:
store_items = store_items.rename(index={'store 2':'store 1','store 3':'store 2'})
store_items

         bikes  watches  glasses  shirts  outfits
store 1     15       60     10.0      22       29
store 2     11       11     11.0      11       11

we can use the values of a column as a row index labels :)

## dealing with Nan values 
- important before analyzing data or train a machine learning algorithm with it
- we first need to clean it (detect and correct errors)
- types of bad data 
 - outliers 
 - incorrect values
 - missing values (mostly)

In [106]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])

# We display the DataFrame
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

##### in a large data set we can't visualize all Nan values

### counting the number of Nan values

In [107]:
store_items.isnull()

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1  False  False    False   False  False  False     True
store 2  False  False    False   False  False  False    False
store 3  False  False    False    True  False   True    False

- in pandas 
 - logical true has value 1
 - logical false has numerical value 0
 - so we can get the Nans by counting the logical ones

In [108]:
store_items.isnull().sum()

bikes      0
pants      0
watches    0
shirts     1
shoes      0
suits      1
glasses    1
dtype: int64

this sums for each column and produces a column

In [109]:
store_items.isnull().sum().sum()

3

if we used it again on the remaining column we will get the values

### counting the number of non-Nan values

In [110]:
store_items.count()

bikes      3
pants      3
watches    3
shirts     2
shoes      3
suits      2
glasses    2
dtype: int64

## after detecting the Nan values we can
- remove them 
- replace them

### remove a Nan method
- using .dropna(axis)
 - if axis = 0, drop any row with a Nan value 
 - if axis = 1, drop any column with a Nan value 
- drop happens out of place
- to remove them in place, set the attribute inplace= True

In [85]:
store_items.dropna(axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 2     15      5       10     2.0      5    7.0     50.0

In [86]:
store_items.dropna(axis = 1)

         bikes  pants  watches  shoes
store 1     20     30       35      8
store 2     15      5       10      5
store 3     20     30       35     10

In [87]:
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

### replace a Nan method
- you can use .fillna() to replace it with a value that we choose
 - also happens out of place
- replace the NaNs with values of previous row or column
 - using fillna with method ffill (stands for forward filling
 - use axis to decide a previous row or a previous column 
- replace with values from the following row or column
 - same way but set the method="backfill"
- replace Nans using different interpolations method with .interpolate()
 - using linear interpolation (with method="linear") using the values before it along the column or row (with axis = 0 or 1)

#### replace it with a value of our choise

In [111]:
store_items.fillna(0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      0.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     0.0     10    0.0      4.0

##### with the mean of each column

In [112]:
store_items.mean()

bikes      18.333333
pants      21.666667
watches    26.666667
shirts      8.500000
shoes       7.666667
suits      26.000000
glasses    27.000000
dtype: float64

In [113]:
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [120]:
store_items.fillna(store_items.mean(),axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0     27.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     8.5     10   26.0      4.0

#### replace it with a value from previous row or column

In [121]:
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [122]:
store_items.fillna(method="ffill",axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

notice that the NaNs in the first row still a Nan (no previous row)

In [123]:
store_items.fillna(method="ffill",axis=1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    35.0   10.0   10.0      4.0

#### backword filling

In [124]:
store_items.fillna(method="backfill",axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0     50.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [125]:
store_items.fillna(method="backfill",axis=1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0      NaN
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    10.0   10.0    4.0      4.0

#### replace using linear interpolation

In [126]:
store_items.interpolate(method="linear",axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

In [127]:
store_items.interpolate(method="linear",axis=1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    22.5   10.0    7.0      4.0

Example

In [169]:
import pandas as pd
import numpy as np

# DO NOT CHANGE THE VARIABLE NAMES

# Set the precision of our dataframes to one decimal place.
#pd.set_option('precision', 1)

# Create a Pandas DataFrame that contains the ratings some users have given to a series of books. 
# The ratings given are in the range from 1 to 5, with 5 being the best score. 
# The names of the books, the corresponding authors, and the ratings of each user are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

# User ratings are in the order of the book titles mentioned above
# If a user has not rated all books, Pandas will automatically consider the missing values as NaN.
# If a user has mentioned `np.nan` value, then also it means that the user has not yet rated that book.
user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])


# Use the data above to create a Pandas DataFrame that has the following column
# labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'. 
# Let Pandas automatically assign numerical row indices to the DataFrame. 

# TO DO: Create a dictionary with the data given above
dat = {'Author':authors,'Book Title':books, 'User 1':user_1, 'User 2':user_2, 'User 3':user_3, 'User 4':user_4}

# TO DO: Create a Pandas DataFrame using the dictionary created above
book_ratings = pd.DataFrame(dat)
print(book_ratings)
# TO DO:
# If you created the dictionary correctly you should have a Pandas DataFrame
# that has column labels: 
# 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4' 
# and row indices 0 through 4.

# Now replace all the NaN values in your DataFrame with the average rating in
# each column. Replace the NaN values in place. 
# HINT: Use the `pandas.DataFrame.fillna(value, inplace = True)` function for substituting the NaN values. 
# Write your code below:
book_ratings.fillna(book_ratings.mean() ,inplace = True)
print(book_ratings)
# to pick all the books that had a rating of 5
book_ratings.isin([5]).any(axis=1)
book_ratings[book_ratings.isin([5]).any(axis=1)]

                Author           Book Title  User 1  User 2  User 3  User 4
0      Charles Dickens   Great Expectations     3.2     5.0     2.0     4.0
1       John Steinbeck      Of Mice and Men     NaN     1.3     2.3     3.5
2  William Shakespeare     Romeo and Juliet     2.5     4.0     NaN     4.0
3          H. G. Wells     The Time Machine     NaN     3.8     4.0     5.0
4        Lewis Carroll  Alice in Wonderland     NaN     NaN     NaN     4.2
                Author           Book Title  User 1  User 2    User 3  User 4
0      Charles Dickens   Great Expectations    3.20   5.000  2.000000     4.0
1       John Steinbeck      Of Mice and Men    2.85   1.300  2.300000     3.5
2  William Shakespeare     Romeo and Juliet    2.50   4.000  2.766667     4.0
3          H. G. Wells     The Time Machine    2.85   3.800  4.000000     5.0
4        Lewis Carroll  Alice in Wonderland    2.85   3.525  2.766667     4.2

C:\Users\youse\AppData\Local\Temp\ipykernel_12480\4144897230.py:45: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  book_ratings.fillna(book_ratings.mean() ,inplace = True)

            Author          Book Title  User 1  User 2  User 3  User 4
0  Charles Dickens  Great Expectations    3.20     5.0     2.0     4.0
3      H. G. Wells    The Time Machine    2.85     3.8     4.0     5.0

In [168]:
book_ratings.loc[book_ratings.isin([5]).any(axis=1)]

            Author          Book Title  User 1  User 2  User 3  User 4
0  Charles Dickens  Great Expectations    3.20     5.0     2.0     4.0
3      H. G. Wells    The Time Machine    2.85     3.8     4.0     5.0

## loading data into a pandas Data Frame
- we will most likely use it
- pandas allowses to load data bases of different formats into data frames
 - one of the most popular formats is csv
- we can load a csv file into a dataframe using a read_csv() function

In [171]:
google_stock = pd.read_csv('Goog-1.csv')
google_stock

,Date,Open,High,Low,Close,Adj Close,Volume
0,2004-08-19,49.676899,51.693783,47.669952,49.845802,49.845802,44994500
1,2004-08-20,50.178635,54.187561,49.925285,53.805050,53.805050,23005800
2,2004-08-23,55.017166,56.373344,54.172661,54.346527,54.346527,18393200
3,2004-08-24,55.260582,55.439419,51.450363,52.096165,52.096165,15361800
4,2004-08-25,52.140873,53.651051,51.604362,52.657513,52.657513,9257400
...,...,...,...,...,...,...,...
3308,2017-10-09,980.000000,985.424988,976.109985,977.000000,977.000000,891400
3309,2017-10-10,980.000000,981.570007,966.080017,972.599976,972.599976,968400
3310,2017-10-11,973.719971,990.710022,972.250000,989.250000,989.250000,1693300
3311,2017-10-12,987.450012,994.119995,985.000000,987.830017,987.830017,1262400
3312,2017-10-13,992.000000,997.210022,989.000000,989.679993,989.679993,1157700

- pandas assigned numerical row indicies to the data frame
- pandas also used the names in the first row of the csv file to assign column labels

### take a look at the first few rows
 - using .head(number of rows = 5)

In [172]:
google_stock.head()

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200
3  2004-08-24  55.260582  55.439419  51.450363  52.096165  52.096165  15361800
4  2004-08-25  52.140873  53.651051  51.604362  52.657513  52.657513   9257400

In [179]:
google_stock.loc[[0,1,2]]

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200

In [183]:
google_stock.iloc[[0,1,2]]

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200

### take a look at the last 5 rows
- .tail(number of rows = 5)

In [173]:
google_stock.tail(8)

,Date,Open,High,Low,Close,Adj Close,Volume
3305,2017-10-04,957.000000,960.390015,950.690002,951.679993,951.679993,952400
3306,2017-10-05,955.489990,970.909973,955.179993,969.960022,969.960022,1213800
3307,2017-10-06,966.700012,979.460022,963.359985,978.890015,978.890015,1173900
3308,2017-10-09,980.000000,985.424988,976.109985,977.000000,977.000000,891400
3309,2017-10-10,980.000000,981.570007,966.080017,972.599976,972.599976,968400
3310,2017-10-11,973.719971,990.710022,972.250000,989.250000,989.250000,1693300
3311,2017-10-12,987.450012,994.119995,985.000000,987.830017,987.830017,1262400
3312,2017-10-13,992.000000,997.210022,989.000000,989.679993,989.679993,1157700

### check for Nan values

In [188]:
google_stock.isnull().sum().sum()

0

In [118]:
# another way to check wither any of the columns contains Nan values
google_stock.isnull().any()

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

In [190]:
google_stock.isnull().sum(axis=0)

Date         0
Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
dtype: int64

## get statistical information from the data set
- .describe() returns statistics on each column of the data set

In [191]:
google_stock.describe()

,Open,High,Low,Close,Adj Close,Volume
count,3313.000000,3313.000000,3313.000000,3313.000000,3313.000000,3.313000e+03
mean,380.186092,383.493740,376.519309,380.072458,380.072458,8.038476e+06
std,223.818650,224.974534,222.473232,223.853780,223.853780,8.399521e+06
min,49.274517,50.541279,47.669952,49.681866,49.681866,7.900000e+03
25%,226.556473,228.394516,224.003082,226.407440,226.407440,2.584900e+06
50%,293.312286,295.433502,289.929291,293.029114,293.029114,5.281300e+06
75%,536.650024,540.000000,532.409973,536.690002,536.690002,1.065370e+07
max,992.000000,997.210022,989.000000,989.679993,989.679993,8.276810e+07

#### to get the statistics of a certain column

In [192]:
google_stock["Adj Close"].describe()

count    3313.000000
mean      380.072458
std       223.853780
min        49.681866
25%       226.407440
50%       293.029114
75%       536.690002
max       989.679993
Name: Adj Close, dtype: float64

#### look up a certain statistic on the data set or a certain column

In [196]:
google_stock.mean()

C:\Users\youse\AppData\Local\Temp\ipykernel_12480\2995703419.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  google_stock.mean()

Open         3.801861e+02
High         3.834937e+02
Low          3.765193e+02
Close        3.800725e+02
Adj Close    3.800725e+02
Volume       8.038476e+06
dtype: float64

In [194]:
google_stock["Adj Close"].min()

49.681866

### get the correlation between different columns

In [197]:
google_stock.corr()

C:\Users\youse\AppData\Local\Temp\ipykernel_12480\3227909774.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  google_stock.corr()

               Open      High       Low     Close  Adj Close    Volume
Open       1.000000  0.999904  0.999845  0.999745   0.999745 -0.564258
High       0.999904  1.000000  0.999834  0.999868   0.999868 -0.562749
Low        0.999845  0.999834  1.000000  0.999899   0.999899 -0.567007
Close      0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Adj Close  0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Volume    -0.564258 -0.562749 -0.567007 -0.564967  -0.564967  1.000000

## group data to get different types of information
- using .groupby()

In [198]:
data = pd.read_csv("fake-company.csv")
data

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991   Dakota         HR   26   52000
4  1991     Elsa         RD   31   50000
5  1991    Frank      Admin   46   60000
6  1992    Grace      Admin   27   60000
7  1992  Hoffman         RD   32   52000
8  1992    Inaar      Admin   28   62000

In [202]:
# How much money the company spent on salaries each year?
data.groupby(['Year'])["Salary"].sum() # when we use group by, we have to specify what to do with the grouped values (either sum them or get their average or whatever depending on the application)

Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

In [203]:
# To know the average salary for each year
data.groupby(['Year'])["Salary"].mean()

Year
1990    51000.0
1991    54000.0
1992    58000.0
Name: Salary, dtype: float64

In [134]:
# How much in total each employee got paid?
data.groupby(["Name"])["Salary"].sum()

Name
Alice      50000
Bob        48000
Charlie    55000
Dakota     52000
Elsa       50000
Frank      60000
Grace      60000
Hoffman    52000
Inaar      62000
Name: Salary, dtype: int64

In [207]:
data

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991   Dakota         HR   26   52000
4  1991     Elsa         RD   31   50000
5  1991    Frank      Admin   46   60000
6  1992    Grace      Admin   27   60000
7  1992  Hoffman         RD   32   52000
8  1992    Inaar      Admin   28   62000

In [213]:
# what is the salary distribution per department 
data.groupby(["Department"])["Salary"].sum()

Department
Admin    237000
HR       102000
RD       150000
Name: Salary, dtype: int64

but since some departments have records for variant -different- number of years, we need to get the average to describe it better

In [215]:
# what is the salary distribution per department 
data.groupby(["Department"])["Salary"].mean()

Department
Admin    59250.0
HR       51000.0
RD       50000.0
Name: Salary, dtype: float64

In [216]:
# what is the salary distribution per department per year
data.groupby(["Department","Year"])["Salary"].sum()

Department  Year
Admin       1990     55000
            1991     60000
            1992    122000
HR          1990     50000
            1991     52000
RD          1990     48000
            1991     50000
            1992     52000
Name: Salary, dtype: int64

Recommended Practice
We recommend you practice the examples available at the 10 minutes to pandas as a conclusive tutorial.
https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html